/*  This file is part of UKNCBTL.
    UKNCBTL is free software: you can redistribute it and/or modify it under the terms
of the GNU Lesser General Public License as published by the Free Software Foundation,
either version 3 of the License, or (at your option) any later version.
    UKNCBTL is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
See the GNU Lesser General Public License for more details.
    You should have received a copy of the GNU Lesser General Public License along with
UKNCBTL. If not, see <http://www.gnu.org/licenses/>. */

/// \file Board.cpp  Motherboard class implementation

#include "stdafx.h"
#include "Emubase.h"
#include "Board.h"


//////////////////////////////////////////////////////////////////////
// Bus devices

static const uint16_t ProcessorTimerAddressRanges[] =
{
    0177710, 6,  // 177710-177715
    0, 0
};
class CBusDeviceProcessorTimer : public CBusDevice
{
public:
    virtual LPCTSTR GetName() const { return _T("Processor timer"); }
    virtual const uint16_t* GetAddressRanges() const { return ProcessorTimerAddressRanges; }
};

static const uint16_t CpuChannelsAddressRanges[] =
{
    0176660, 16,
    0177560, 8,
    0, 0
};
class CBusDeviceCpuChannels : public CBusDevice
{
public:
    virtual LPCTSTR GetName() const { return _T("CPU-PPU channels"); }
    virtual const uint16_t* GetAddressRanges() const { return CpuChannelsAddressRanges; }
};

static const uint16_t PpuChannelsAddressRanges[] =
{
    0177060, 16,
    0177100, 4,
    0, 0
};
class CBusDevicePpuChannels : public CBusDevice
{
public:
    virtual LPCTSTR GetName() const { return _T("CPU-PPU channels"); }
    virtual const uint16_t* GetAddressRanges() const { return PpuChannelsAddressRanges; }
};

static const uint16_t NetworkAdapterAddressRanges[] =
{
    0176560, 8,
    0, 0
};
class CBusDeviceNetworkAdapter : public CBusDevice
{
public:
    virtual LPCTSTR GetName() const { return _T("Network adapter"); }
    virtual const uint16_t* GetAddressRanges() const { return NetworkAdapterAddressRanges; }
};

static const uint16_t SerialPortAddressRanges[] =
{
    0176570, 8,
    0, 0
};
class CBusDeviceSerialPort : public CBusDevice
{
public:
    virtual LPCTSTR GetName() const { return _T("Serial port"); }
    virtual const uint16_t* GetAddressRanges() const { return SerialPortAddressRanges; }
};

static const uint16_t CpuMemoryAccessAddressRanges[] =
{
    0176640, 8,
    0176564, 4,  // Регистры пультового терминала
    0, 0
};
class CBusDeviceCpuMemoryAccess : public CBusDevice
{
public:
    virtual LPCTSTR GetName() const { return _T("Memory access"); }
    virtual const uint16_t* GetAddressRanges() const { return CpuMemoryAccessAddressRanges; }
};

static const uint16_t PpuMemoryAccessAddressRanges[] =
{
    0177010, 16,
    0177054, 2,
    0, 0
};
class CBusDevicePpuMemoryAccess : public CBusDevice
{
public:
    virtual LPCTSTR GetName() const { return _T("Memory access"); }
    virtual const uint16_t* GetAddressRanges() const { return PpuMemoryAccessAddressRanges; }
};

static const uint16_t ProgrammablePortAddressRanges[] =
{
    0177100, 4,  // i8255 ports
    0, 0
};
class CBusDeviceProgrammablePort : public CBusDevice
{
public:
    virtual LPCTSTR GetName() const { return _T("Programmable port"); }
    virtual const uint16_t* GetAddressRanges() const { return ProgrammablePortAddressRanges; }
};

static const uint16_t KeyboardAddressRanges[] =
{
    0177700, 6,
    0, 0
};
class CBusDeviceKeyboard : public CBusDevice
{
public:
    virtual LPCTSTR GetName() const { return _T("Keyboard"); }
    virtual const uint16_t* GetAddressRanges() const { return KeyboardAddressRanges; }
};

static const uint16_t FloppyControllerAddressRanges[] =
{
    0177130, 4,
    0, 0
};
class CBusDeviceFloppyController : public CBusDevice
{
public:
    virtual LPCTSTR GetName() const { return _T("Floppy controller"); }
    virtual const uint16_t* GetAddressRanges() const { return FloppyControllerAddressRanges; }
};

static const uint16_t HardDriveAddressRanges[] =
{
    0110000, 010000,
    0, 0
};
class CBusDeviceHardDrive : public CBusDevice
{
public:
    virtual LPCTSTR GetName() const { return _T("Hard drive"); }
    virtual const uint16_t* GetAddressRanges() const { return HardDriveAddressRanges; }
};


//////////////////////////////////////////////////////////////////////

CMotherboard::CMotherboard ()
{
    memset(freq_per, 0, sizeof(freq_per));
    memset(freq_out, 0, sizeof(freq_out));
    memset(freq_enable, 0, sizeof(freq_enable));
    m_multiply = 1;
    memset(m_chancputx, 0, sizeof(m_chancputx));
    memset(m_chancpurx, 0, sizeof(m_chancpurx));
    memset(m_chanpputx, 0, sizeof(m_chanpputx));
    memset(m_chanppurx, 0, sizeof(m_chanppurx));

    m_dwTrace = TRACE_NONE;
    m_CPUbps = m_PPUbps = nullptr;
    m_TapeReadCallback = nullptr;
    m_TapeWriteCallback = nullptr;
    m_nTapeSampleRate = 0;
    m_SoundGenCallback = nullptr;
    m_SoundPrevValue = 0;
    m_SerialInCallback = nullptr;
    m_SerialOutCallback = nullptr;
    m_ParallelOutCallback = nullptr;
    m_NetworkInCallback = nullptr;
    m_NetworkOutCallback = nullptr;
    m_TerminalOutCallback = nullptr;
    m_okSoundAY = m_okSoundCovox = false;

    // Create devices
    m_pCPU = new CProcessor(_T("CPU"));
    m_pPPU = new CProcessor(_T("PPU"));
    m_pFirstMemCtl = new CFirstMemoryController();
    m_pSecondMemCtl = new CSecondMemoryController();
    m_pFloppyCtl = new CFloppyController();
    m_pHardDrives[0] = nullptr;
    m_pHardDrives[1] = nullptr;
    m_pSoundAY[0] = new CSoundAY();
    m_pSoundAY[1] = new CSoundAY();
    m_pSoundAY[2] = new CSoundAY();

    // Connect devices
    m_pCPU->AttachMemoryController(m_pFirstMemCtl);
    m_pFirstMemCtl->Attach(this, m_pCPU);
    m_pPPU->AttachMemoryController(m_pSecondMemCtl);
    m_pSecondMemCtl->Attach(this, m_pPPU);

    // Allocate memory for RAM and ROM
    m_pRAM[0] = static_cast<uint8_t*>(calloc(65536, 1));
    m_pRAM[1] = static_cast<uint8_t*>(calloc(65536, 1));
    m_pRAM[2] = static_cast<uint8_t*>(calloc(65536, 1));
    m_pROM    = static_cast<uint8_t*>(calloc(32768, 1));
    m_pROMCart[0] = nullptr;
    m_pROMCart[1] = nullptr;

    // Prepare bus devices
    m_pCpuDevices = static_cast<CBusDevice**>(calloc(6, sizeof(CBusDevice*)));
    m_pCpuDevices[0] = new CBusDeviceProcessorTimer();
    m_pCpuDevices[1] = new CBusDeviceCpuChannels();
    m_pCpuDevices[2] = new CBusDeviceNetworkAdapter();
    m_pCpuDevices[3] = new CBusDeviceSerialPort();
    m_pCpuDevices[4] = new CBusDeviceCpuMemoryAccess();
    m_pCpuDevices[5] = nullptr;
    m_pPpuDevices = static_cast<CBusDevice**>(calloc(8, sizeof(CBusDevice*)));
    m_pPpuDevices[0] = new CBusDeviceProcessorTimer();
    m_pPpuDevices[1] = new CBusDevicePpuChannels();
    m_pPpuDevices[2] = new CBusDevicePpuMemoryAccess();
    m_pPpuDevices[3] = new CBusDeviceProgrammablePort();
    m_pPpuDevices[4] = new CBusDeviceKeyboard();
    m_pPpuDevices[5] = new CBusDeviceFloppyController();
    m_pPpuDevices[6] = new CBusDeviceHardDrive();
    m_pPpuDevices[7] = nullptr;

    m_pFirstMemCtl->AttachDevices((const CBusDevice**)m_pCpuDevices);
    m_pSecondMemCtl->AttachDevices((const CBusDevice**)m_pPpuDevices);
}

CMotherboard::~CMotherboard ()
{
    // Delete bus devices
    CBusDevice** ppDevice = m_pCpuDevices;
    while (*ppDevice != nullptr)
    {
        delete *ppDevice;
        *ppDevice = nullptr;
        ppDevice++;
    }
    free(m_pCpuDevices);
    ppDevice = m_pPpuDevices;
    while (*ppDevice != nullptr)
    {
        delete *ppDevice;
        *ppDevice = nullptr;
        ppDevice++;
    }
    free(m_pPpuDevices);

    // Delete devices
    delete m_pCPU;
    delete m_pPPU;
    delete m_pFirstMemCtl;
    delete m_pSecondMemCtl;
    delete m_pFloppyCtl;
    delete m_pSoundAY[0];
    delete m_pSoundAY[1];
    delete m_pSoundAY[2];

    // Free memory
    free(m_pRAM[0]);
    free(m_pRAM[1]);
    free(m_pRAM[2]);
    free(m_pROM);
    if (m_pROMCart[0] != nullptr) free(m_pROMCart[0]);
    if (m_pROMCart[1] != nullptr) free(m_pROMCart[1]);
    if (m_pHardDrives[0] != nullptr) delete m_pHardDrives[0];
    if (m_pHardDrives[1] != nullptr) delete m_pHardDrives[1];
}

void CMotherboard::SetTrace(uint32_t dwTrace)
{
    m_dwTrace = dwTrace;
    if (m_pPPU != nullptr)
        m_pPPU->SetTrace((dwTrace & TRACE_PPU) != 0);
    if (m_pCPU != nullptr)
        m_pCPU->SetTrace((dwTrace & TRACE_CPU) != 0);
    if (m_pFloppyCtl != nullptr)
        m_pFloppyCtl->SetTrace((dwTrace & TRACE_FLOPPY) != 0);
}

void CMotherboard::Reset ()
{
    m_pPPU->SetDCLOPin(true);
    m_pPPU->SetACLOPin(true);

    ResetFloppy();

    if (m_pHardDrives[0] != nullptr)
        m_pHardDrives[0]->Reset();
    if (m_pHardDrives[1] != nullptr)
        m_pHardDrives[1]->Reset();

    m_cputicks = 0;
    m_pputicks = 0;
    m_lineticks = 0;
    m_timer = 0;
    m_timerreload = 0;
    m_timerflags = 0;
    m_timerdivider = 0;

    m_chan0disabled = 0;

    m_scanned_key = 0;
    memset(m_kbd_matrix, 0, sizeof(m_kbd_matrix));
    m_kbd_matrix[3].row_Y = 0xFF;

    memset(m_nSoundAYReg, 0, sizeof(m_nSoundAYReg));
    m_pSoundAY[0]->Reset();
    m_pSoundAY[1]->Reset();
    m_pSoundAY[2]->Reset();

    //ChanResetByCPU();
    //ChanResetByPPU();

    // We always start with PPU
    m_pPPU->SetDCLOPin(false);
    m_pPPU->SetACLOPin(false);
}

void CMotherboard::LoadROM(const uint8_t* pBuffer)  // Load 32 KB ROM image from the buffer
{
    memcpy(m_pROM, pBuffer, 32768);
}

void CMotherboard::LoadROMCartridge(int cartno, const uint8_t* pBuffer)  // Load 24 KB ROM cartridge image
{
    ASSERT(cartno == 1 || cartno == 2);  // Only two cartridges, #1 and #2
    ASSERT(pBuffer != nullptr);

    int cartindex = cartno - 1;
    if (m_pROMCart[cartindex] == nullptr)
        m_pROMCart[cartindex] = static_cast<uint8_t*>(calloc(24 * 1024, 1));

    memcpy(m_pROMCart[cartindex], pBuffer, 24 * 1024);
}

void CMotherboard::LoadRAM(int plan, const uint8_t* pBuffer)  // Load 32 KB RAM image from the buffer
{
    ASSERT(plan >= 0 && plan <= 2);
    memcpy(m_pRAM[plan], pBuffer, 32768);
}

void CMotherboard::SetNetStation(uint16_t station)
{
    CFirstMemoryController* pMemCtl = static_cast<CFirstMemoryController*>(m_pFirstMemCtl);
    pMemCtl->m_NetStation = station;
}


// Floppy ////////////////////////////////////////////////////////////

bool CMotherboard::IsFloppyImageAttached(int slot) const
{
    ASSERT(slot >= 0 && slot < 4);
    return m_pFloppyCtl->IsAttached(slot);
}

bool CMotherboard::IsFloppyReadOnly(int slot) const
{
    ASSERT(slot >= 0 && slot < 4);
    return m_pFloppyCtl->IsReadOnly(slot);
}

bool CMotherboard::IsFloppyEngineOn() const
{
    return m_pFloppyCtl->IsEngineOn();
}

bool CMotherboard::AttachFloppyImage(int slot, LPCTSTR sFileName)
{
    ASSERT(slot >= 0 && slot < 4);
    return m_pFloppyCtl->AttachImage(slot, sFileName);
}

void CMotherboard::DetachFloppyImage(int slot)
{
    ASSERT(slot >= 0 && slot < 4);
    m_pFloppyCtl->DetachImage(slot);
}


// ROM cartridge /////////////////////////////////////////////////////

bool CMotherboard::IsROMCartridgeLoaded(int cartno) const
{
    ASSERT(cartno == 1 || cartno == 2);  // Only two cartridges, #1 and #2
    int cartindex = cartno - 1;
    return (m_pROMCart[cartindex] != nullptr);
}

void CMotherboard::UnloadROMCartridge(int cartno)
{
    ASSERT(cartno == 1 || cartno == 2);  // Only two cartridges, #1 and #2
    int cartindex = cartno - 1;
    if (m_pROMCart[cartindex] != nullptr)
    {
        free(m_pROMCart[cartindex]);
        m_pROMCart[cartindex] = nullptr;
    }
}


// Hard Drives ///////////////////////////////////////////////////////

bool CMotherboard::IsHardImageAttached(int slot) const
{
    ASSERT(slot >= 1 && slot <= 2);
    return (m_pHardDrives[slot - 1] != nullptr);
}

bool CMotherboard::IsHardImageReadOnly(int slot) const
{
    ASSERT(slot >= 1 && slot <= 2);
    CHardDrive* pHardDrive = m_pHardDrives[slot - 1];
    if (pHardDrive == nullptr) return false;
    return pHardDrive->IsReadOnly();
}

bool CMotherboard::AttachHardImage(int slot, LPCTSTR sFileName)
{
    ASSERT(slot >= 1 && slot <= 2);

    m_pHardDrives[slot - 1] = new CHardDrive();
    bool success = m_pHardDrives[slot - 1]->AttachImage(sFileName);
    if (success)
    {
        m_pHardDrives[slot - 1]->Reset();
        m_pSecondMemCtl->UpdateMemoryMap();
    }

    return success;
}
void CMotherboard::DetachHardImage(int slot)
{
    ASSERT(slot >= 1 && slot <= 2);

    delete m_pHardDrives[slot - 1];
    m_pHardDrives[slot - 1] = nullptr;
}

uint16_t CMotherboard::GetHardPortWord(int slot, uint16_t port)
{
    ASSERT(slot >= 1 && slot <= 2);

    if (m_pHardDrives[slot - 1] == nullptr) return 0;
    port = (uint16_t) (~(port >> 1) & 7) | 0x1f0;
    uint16_t data = m_pHardDrives[slot - 1]->ReadPort(port);
    return ~data;  // QBUS inverts the bits
}
void CMotherboard::SetHardPortWord(int slot, uint16_t port, uint16_t data)
{
    ASSERT(slot >= 1 && slot <= 2);

    if (m_pHardDrives[slot - 1] == nullptr) return;
    port = (uint16_t) (~(port >> 1) & 7) | 0x1f0;
    data = ~data;  // QBUS inverts the bits
    m_pHardDrives[slot - 1]->WritePort(port, data);
}


// Memory control ////////////////////////////////////////////////////

uint16_t CMotherboard::GetROMWord(uint16_t offset) const
{
    ASSERT(offset < 32768);
    return *((uint16_t*)(m_pROM + (offset & 0xFFFE)));
}
uint8_t CMotherboard::GetROMByte(uint16_t offset) const
{
    ASSERT(offset < 32768);
    return m_pROM[offset];
}

uint16_t CMotherboard::GetROMCartWord(int cartno, uint16_t offset) const
{
    ASSERT(cartno == 1 || cartno == 2);
    ASSERT(offset < 24 * 1024 - 1);
    int cartindex = cartno - 1;
    if (m_pROMCart[cartindex] == nullptr)
        return 0177777;
    uint16_t* p = (uint16_t*) (m_pROMCart[cartindex] + (offset & 0xFFFE));
    return *p;
}
uint8_t CMotherboard::GetROMCartByte(int cartno, uint16_t offset) const
{
    ASSERT(cartno == 1 || cartno == 2);
    ASSERT(offset < 24 * 1024);
    int cartindex = cartno - 1;
    if (m_pROMCart[cartindex] == nullptr)
        return 0377;
    uint8_t* p = m_pROMCart[cartindex] + offset;
    return *p;
}


//////////////////////////////////////////////////////////////////////


void CMotherboard::ResetFloppy()
{
    m_pFloppyCtl->Reset();
}

void CMotherboard::Tick8000 ()
{
    m_pCPU->Execute();
}
void CMotherboard::Tick6250 ()
{
    m_pPPU->Execute();
}
void CMotherboard::Tick50 ()
{
    if ((m_pPPU->GetMemoryController()->GetPortView(0177054) & 0400) == 0)
        m_pPPU->TickEVNT();
    if ((m_pPPU->GetMemoryController()->GetPortView(0177054) & 01000) == 0)
        m_pCPU->TickEVNT();
}

void CMotherboard::ExecuteCPU ()
{
    m_pCPU->Execute();
}

void CMotherboard::ExecutePPU ()
{
    m_pPPU->Execute();
}

void CMotherboard::TimerTick() // Timer Tick, 2uS -- dividers are within timer routine
{
    if ((m_timerflags & 1) == 0)  // Timer is off
        return;
    if ((m_timerflags & 040) != 0)  // External event is ready
        return;

    m_timerdivider++;

    int flag = 0;
    switch ((m_timerflags >> 1) & 3)
    {
    case 0: //2uS
        flag = 1;
        m_timerdivider = 0;
        break;
    case 1: //4uS
        if (m_timerdivider >= 2)
        {
            flag = 1;
            m_timerdivider = 0;
        }
        break;
    case 2: //8uS
        if (m_timerdivider >= 4)
        {
            flag = 1;
            m_timerdivider = 0;
        }
        break;
    case 3:
        if (m_timerdivider >= 8)
        {
            flag = 1;
            m_timerdivider = 0;
        }
        break;
    }

    if (flag == 0)  // Nothing happened
        return;

    m_timer--;
    m_timer &= 07777;  // 12 bit only

    if (m_timer == 0)
    {
        if (m_timerflags & 0200)
            m_timerflags |= 010;  // Overflow
        m_timerflags |= 0200;  // 0

        if ((m_timerflags & 0100) && (m_timerflags & 0200))
        {
            m_pPPU->InterruptVIRQ(2, 0304);
        }

        m_timer = m_timerreload & 07777; // Reload it
    }
}
uint16_t CMotherboard::GetTimerValue()  // Returns current timer value
{
    if ((m_timerflags & 0240) == 0)
        return m_timer;

    m_timerflags &= ~0240;  // Clear flags
    uint16_t res = m_timer;
    m_timer = m_timerreload & 07777; // Reload it
    return res;
}
uint16_t CMotherboard::GetTimerReload()  // Returns timer reload value
{
    return m_timerreload;
}
uint16_t CMotherboard::GetTimerState() // Returns timer state
{
    uint16_t res = m_timerflags;
    m_timerflags &= ~010;  // Clear overflow
    return res;
}

void CMotherboard::SetTimerReload(uint16_t val)  // Sets timer reload value
{
    m_timerreload = val & 07777;
    if ((m_timerflags & 1) == 0)
        m_timer = m_timerreload;
}

void CMotherboard::SetTimerState(uint16_t val) // Sets timer state
{
    // 753   200 40 10
    if ((val & 1) && ((m_timerflags & 1) == 0))
        m_timer = m_timerreload & 07777;

    m_timerflags &= 0250;  // Clear everything but bits 7,5,3
    m_timerflags |= (val & (~0250));  // Preserve bits 753

    switch ((m_timerflags >> 1) & 3)
    {
    case 0: //2uS
        m_multiply = 8;
        break;
    case 1: //4uS
        m_multiply = 4;
        break;
    case 2: //8uS
        m_multiply = 2;
        break;
    case 3:
        m_multiply = 1;
        break;
    }
}

void CMotherboard::SetSoundAYReg(int chip, uint8_t reg)
{
    if (chip >= 0 && chip < 3)
        m_nSoundAYReg[chip] = reg;
}

void CMotherboard::SetSoundAYVal(int chip, uint8_t val)
{
    if (m_okSoundAY && chip >= 0 && chip < 3)
    {
        m_pSoundAY[chip]->SetReg(m_nSoundAYReg[chip], val);
    }
}

void CMotherboard::SetMouse(bool onoff)
{
    ((CSecondMemoryController*)m_pSecondMemCtl)->SetMouse(onoff);
}

void CMotherboard::MouseMove(int16_t dx, int16_t dy, bool btnLeft, bool btnRight)
{
    ((CSecondMemoryController*)m_pSecondMemCtl)->MouseMove(dx, dy, btnLeft, btnRight);
}


void CMotherboard::DebugTicks()
{
    if (!m_pPPU->IsStopped())
    {
        while (m_pPPU->InterruptProcessing()) {}
        m_pPPU->CommandExecution();
        while (m_pPPU->InterruptProcessing()) {}
    }
    if (!m_pCPU->IsStopped())
    {
        while (m_pCPU->InterruptProcessing()) {}
        m_pCPU->CommandExecution();
        while (m_pCPU->InterruptProcessing()) {}
    }
    if (!m_pPPU->IsStopped()) while (m_pPPU->InterruptProcessing()) {}
}

/*
Каждый фрейм равен 1/25 секунды = 40 мс = 20000 тиков, 1 тик = 2 мкс.

* 20000 тиков системного таймера - на каждый 1-й тик
* 2 сигнала EVNT, в 0-й и 10000-й тик фрейма
* 320000 тиков ЦП - 16 раз за один тик
* 250000 тиков ПП - 12.5 раз за один тик
* Отрисовка 288 видимых строк, по 32 тика на строку (только в первой половине фрейма)
** Первая невидимая строка (#0) начинает рисоваться на 96-ой тик
** Первая видимая строка (#18) начинает рисоваться на 672-й тик
* 625 тиков FDD - каждый 32-й тик
* 48 тиков обмена с COM-портом - каждый 416 тик
* 8?? тиков обмена с NET-портом - каждый 64 тик ???
*/
#define SYSTEMFRAME_EXECUTE_CPU     { m_pCPU->Execute(); }
#define SYSTEMFRAME_EXECUTE_PPU     { m_pPPU->Execute(); }
#define SYSTEMFRAME_EXECUTE_BP_CPU  { m_pCPU->Execute(); if (m_CPUbps != nullptr) \
    { const uint16_t* pbps = m_CPUbps; while(*pbps != 0177777) { if (m_pCPU->GetPC() == *pbps++) return false; } } }
#define SYSTEMFRAME_EXECUTE_BP_PPU  { m_pPPU->Execute(); if (m_PPUbps != nullptr) \
    { const uint16_t* pbps = m_PPUbps; while(*pbps != 0177777) { if (m_pPPU->GetPC() == *pbps++) return false; } } }
bool CMotherboard::SystemFrame()
{
    int frameticks = 0;  // count 20000 ticks

    m_SoundChanges = 0;
    int soundSamplesPerFrame = SAMPLERATE / 25, soundBrasErr = 0;

    const int serialOutTicks = 20000 / (9600 / 25);
    int serialTxCount = 0;
    const int networkOutTicks = 7; //20000 / (57600 / 25);
    int networkTxCount = 0;

    int tapeSamplesPerFrame = 1, tapeBrasErr = 0;
    if (m_TapeReadCallback != nullptr || m_TapeWriteCallback != nullptr)
        tapeSamplesPerFrame = m_nTapeSampleRate / 25;

    do
    {
        TimerTick();  // System timer tick

        if (frameticks % 10000 == 0)
            Tick50();  // 1/50 timer event

        // CPU - 16 times, PPU - 12.5 times
        if (m_CPUbps == nullptr && m_PPUbps == nullptr)  // No breakpoints, no need to check
        {
            /*  0 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;
            /*  1 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;
            /*  2 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;  SYSTEMFRAME_EXECUTE_CPU;
            /*  3 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;
            /*  4 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;
            /*  5 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;  SYSTEMFRAME_EXECUTE_CPU;
            /*  6 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;
            /*  7 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;
            /*  8 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;  SYSTEMFRAME_EXECUTE_CPU;
            /*  9 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;
            /* 10 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;
            /* 11 */  SYSTEMFRAME_EXECUTE_CPU;  SYSTEMFRAME_EXECUTE_PPU;  SYSTEMFRAME_EXECUTE_CPU;
            if ((frameticks & 1) == 0)  // (frameticks % 2 == 0) PPU extra ticks
                SYSTEMFRAME_EXECUTE_PPU;
        }
        else  // Have breakpoint, need to check
        {
            /*  0 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;
            /*  1 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;
            /*  2 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;  SYSTEMFRAME_EXECUTE_BP_CPU;
            /*  3 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;
            /*  4 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;
            /*  5 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;  SYSTEMFRAME_EXECUTE_BP_CPU;
            /*  6 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;
            /*  7 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;
            /*  8 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;  SYSTEMFRAME_EXECUTE_BP_CPU;
            /*  9 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;
            /* 10 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;
            /* 11 */  SYSTEMFRAME_EXECUTE_BP_CPU;  SYSTEMFRAME_EXECUTE_BP_PPU;  SYSTEMFRAME_EXECUTE_BP_CPU;
            if ((frameticks & 1) == 0)  // (frameticks % 2 == 0) PPU extra ticks
                SYSTEMFRAME_EXECUTE_BP_PPU;
        }

        if ((frameticks & 31) == 0)  // (frameticks % 32 == 0)
        {
            m_pFloppyCtl->Periodic();  // Each 32nd tick -- FDD tick

            // Keyboard processing
            CSecondMemoryController* pMemCtl = static_cast<CSecondMemoryController*>(m_pSecondMemCtl);
            if ((pMemCtl->m_Port177700 & 0200) == 0)
            {
                uint8_t row_Y = m_scanned_key & 0xF;
                uint8_t col_X = (m_scanned_key & 0x70) >> 4;
                uint8_t bit_X = 1 << col_X;
                pMemCtl->m_Port177702 = m_scanned_key;
                if ((m_scanned_key & 0200) == 0)
                {
                    if ((m_kbd_matrix[row_Y].processed == 0) && ((m_kbd_matrix[row_Y].row_Y & bit_X) != 0))
